<!doctype html>
<html lang="en-US">
<meta http-equiv="content-type" content="text/html;charset=UTF-8" />

<head>
  <?php require("common/head.php"); ?>
</head>

<body class="home wp-singular page-template page-template-elementor_header_footer page page-id-9322 wp-embed-responsive wp-theme-peacealign elementor-default elementor-template-full-width elementor-kit-8 elementor-page elementor-page-9322">
  <div class="search-wrap">
    <div class="search-inner">
      <i class="fas fa-times search-close" id="search-close"></i>
      <div class="search-cell">
        <form action="https://wp.tonictheme.com/wp067/">
          <div class="search-field-holder">
            <input type="text" name="s" class="main-search-input" placeholder="Search....">
          </div>
        </form>
      </div>
    </div>
  </div>
  <!--<< Mouse Cursor Start >>-->
  <div class="mouse-cursor cursor-outer"></div>
  <div class="mouse-cursor cursor-inner"></div>
  <?php //require("common/loader.php"); 
  ?>
  </div>
  <div class="fix-area">
    <div class="offcanvas__info">
      <div class="offcanvas__wrapper">
        <div class="offcanvas__content">
          <div class="offcanvas__top mb-5 d-flex justify-content-between align-items-center">
            <div class="offcanvas__logo">
              <a class="d-inline-block site-logo" href="https://wp.tonictheme.com/wp067">
                <img src="wp-content/uploads/2025/10/Frame-1810.png" alt="" />
              </a>
            </div>
            <div class="offcanvas__close">
              <button>
                <i class="fas fa-times"></i>
              </button>
            </div>
          </div>
          <p class="text d-none d-lg-block"> We understand better that enim ad minim veniam, consectetur adipis cing elit, sed do </p>
          <div class="mobile-menu fix mb-3"></div>
        </div>
      </div>
    </div>
  </div>
  <div class="offcanvas__overlay"></div>
  <div class="scroll-up">
    <svg class="scroll-circle svg-content" width="100%" height="100%" viewBox="-1 -1 102 102">
      <path d="M50,1 a49,49 0 0,1 0,98 a49,49 0 0,1 0,-98" />
    </svg>
  </div>
  <div id="page" class="site">
    <header id="masthead" class="site-header">
      <!-- Header Top Start -->
      <?php require("common/header.php"); ?>
    </header>
    <div class="breadcrumb-wrapper section-padding bg-cover navbar-" style="background-image: url('wp-content/uploads/2025/10/image-52-16.png');">
      <div class="container">
        <div class="page-heading">
          <div class="breadcrumb-sub-title">
            <h1 class="wow fadeInUp" data-wow-delay=".3s" style="visibility: visible; animation-delay: 0.3s; animation-name: fadeInUp;">Damma Prabhat </h1>
          </div>
          <ul class="page-list">
            <li>
              <a href="index.html">Home</a>
            </li>
            <li>
              <span>Damma Prabha</span>
            </li>
          </ul>
        </div>
      </div>
    </div>
    <div id="content" class="site-content py-4">
      <div class="container my-3">
        <h3 class="mb-2">बुद्ध सासनं चिरं तिट्ठतु ।
          [बुद्ध शासन कायम रहे ।]
        </h3>
        <div class="row gy-3">
          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title ">
                  <q>
                    <p> ये च बुद्धा अतीता च ये च बुद्धा अनागता।</p>
                    <p> पच्चुपन्ना च ये बुद्धा अहं वन्दामि सब्बदा।।</p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  बुद्धत्व प्राप्ति के बाद एक बार भगवान बुद्ध राजगृह में अपने विशाल संघ के साथ विहार कर रहे थे। तब महाराज शुद्धोदन ने उन्हें कपिलवस्तु आमंत्रित करने के लिए एक दूत भेजा। राजगृह पहुँच कर वो दूत भगवान के धम्म प्रभाव में प्रव्रजित होकर संघ में सम्मिलित हो गए। बहुत दिनों तक कोई समाचार नहीं आया, तो महाराज ने दूसरा दूतमण्डल भेजा। वो भी प्रव्रजित होकर भगवान के पावन संघ में शामिल हो गए। इस प्रकार कई दूत मण्डलों को निमंत्रण के लिए भेजने के विफल प्रयासों के बाद महाराज शुद्धोदन ने अपने सबसे विश्वसनीय आमात्य एवं सिद्धार्थ के बालसखा कालु उदायी को भेजा। कालु उदायी ने कहा- महाराज, एक शर्त पर जाऊंगा, कि मुझे भी प्रव्रज्या की अनुमति मिले<b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn1" onclick="showmsg(1)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p> [ विमुक्ति रत्न ] </p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  महाराज मिलिन्द ने भन्ते नागसेेन से पुछा- "भगवान का विमुक्ति रत्न क्या है?"
                  <br><br>
                  “महाराज! विमुक्ति-रत्न अर्हत-पद को कहते हैं। अर्हत हो कर भिक्खु विमुक्ति-रत्न से शोभित हो जाता है।
                  <br><br>
                  "महाराज! जैसे कोई पुरुष मोती, मणि, सोने और मूंगे के आभूषणों से आभूषित हो। अगर, तगर, तालिसक, लाल चन्दन इत्यादि के लेप से अपने गात्र को सुगन्धित बना ले।
                  नाग, पुनाग, साल सलल, चम्पक, जूही, अतिमुक्तक, गुलाब, कमल, मालती, मल्लिका इत्यादि फूलों के हार से अपने को सजा ले।

                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn2" onclick="showmsg(2)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p> [देवानांप्रिय प्रियदर्शी सम्राट अशोक सर्वोत्तम धम्म प्रचारक] </p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  गौतम बुद्ध न कपोलकल्पित है या न किसी धूर्त लोगों की कलम से निकले हुए है। भगवान  बुद्ध और उनके धम्म को संरक्षित रखने के लिए देवानांप्रिय प्रियदर्शी सम्राट अशोक ने जो कदम उठाए उनकी बदोलत आज भगवान बुद्ध और उनके धम्म को कोई कल्पित नहि कह सकता है। अपने विशाल साम्राज्य में अशोक ने 84000 स्तूप बनवाए और बुद्ध के धम्म स्कंंधों को शीलापट व शीला स्तंभ पर अभिलेख खुदवाए।
                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn3" onclick="showmsg(3)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p>[बोधिपक्षिय धम्म]</p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  बोधिपक्षिय धम्म कितने है?
                  <br>
                  बोधिपक्षिय धम्म 37 है।
                  <br>
                  कौन से 37?
                  <br>
                  (1) चार सतीपठ्ठान:<br>
                  - कायानुपस्सी - कायानुदर्शन
                  - वेदनानुपस्सी - वेदनानुदर्शन -
                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn4" onclick="showmsg(4)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p>[दूसरों की निंदा करने वाला एकाग्रता प्राप्त नहीं कर सकता है।] </p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  अनाथपिण्डिक के द्वारा बनाया गया जेतवन विहार में तथागत विहार करते थे। उस समय एक युवक ने प्रव्रज्या ग्रहण की और उसका नाम तिस्स रखा गया। तिस्स को दूसरे की निंदा करने की बुरी आदत थी। वह अनाथपिण्डिक  और  विशाखा  जैसे महादानियों की भी निंदा करता था। कारण हो या ना हो वह दूसरे की निंदा करना चुकता नहीं था। वह निंदा करने का कारण खोज लेता था। कोई कारण न मिले तो स्वयं कारण निर्मित कर लेता था। कोई  दान दे, तो निंदा करता था और  कोई दान दे तो कहता,-" अरे! यह भी कोई दान है! दान देना सीखना हो तो मेरे परिवार  से सीखो।" वह अपने परिवार की प्रशंसा में लगा रहता, शेष सारे संसार की निंदा।
                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn5" onclick="showmsg(5)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p>[भन्ते भगवान! क्या आप सब पर समान रूप से करूणा भाव रखते हैं?]</p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  भगवान गौतमबुद्ध से प्रश्न पूछा गया कि क्या आप सब पर समान रूप से करूणा भाव रखते हैं, यदि हां तो किसी को बहुत लाभ होता है, किसी को मध्यम तो कोई कोई धर्म लाभ से वंचित रह जाता है, ऐसा क्यों? आपकी मंगलमय करूणा का प्रभाव सब पर एक जैसा क्यों नहीं होता?

                  भगवान ने उसे एक किसान का उदाहरण देते हुए समझाया कि उसके पास तीन तरह की जमीन है—
                  1) बहुत उपजाऊ
                  2) मध्यम उपजाऊ
                  3) बिल्कुल उसर-बंजर।<br>
                  ऐसे में वह सबसे पहले उपजाऊ जमीन पर बीज डालता है, उसके बाद मध्यम में और सबसे अंत में उसर-बंजर में। बीज
                  वही है और उतनी ही मेहनत और लगन से डाला जाता है। लेकिन फसल एक सी नहीं होती।
                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn6" onclick="showmsg(6)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p>[सोने के समान चित्त के पांच मल]</p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  भिक्षुओ ! सोने के पांच मल होते हैं, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न व्यवहार के योग्य होता है। <br>

                  कौन से पांच ?<br>

                  भिक्षुओ ! काला लोहा (अयसक) सोना का मल होता है, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है और न व्यवहार के योग्य होता है।<br>
                  लोहा सोना का मल होता है, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है और न व्यवहार के योग्य होता है।
                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn7" onclick="showmsg(7)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p>[अष्टकलाप] </p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  2568 वर्ष पूर्व वैशाख पूर्णिमा की रात्रि को सिद्धार्थ गौतम को सम्बोधि प्राप्त हुई । सर्वज्ञता प्राप्त हुई। प्रकृति के रहस्यों को जान लिया। <br><br>
                  सर्वज्ञता का साक्षात्कार पाने पर भगवान बुद्ध ने प्रकृति की वास्तवता का परीक्षण किया और उन्हें स्पष्ट दीखने लगा कि, उनका यह ठोस प्रतीत होनेवाला शरीर वस्तुत: असंख्य -असंख्य परमाणुओं का, कलापों का पुंज मात्र हैं । ये कलाप परमाणुओं से भी नन्हे हैं और इनके आगे टुकडे नहीं हो सकते ।
                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn8" onclick="showmsg(8)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>


          <div class="col-sm-6">
            <div class="card " style="width: 100%;">
              <div class="card-body">
                <h5 class="card-title">
                  <q>
                    <p>[परियत्ति, पटिपत्ति, पटिवेधन]</p>
                  </q>
                </h5>
                <p class="card-text fw-bold">
                  धम्म (शुद्ध धर्म) के दो प्रमुख पक्ष हैं- पहला सैद्धांतिक पक्ष यानी मूल पाठ जिसे परियत्ति कहते हैं और दूसरा व्यावहारिक यानी प्रायोगिक पक्ष जिसे पटिपत्ति कहते हैं।
                  <br>
                  बुद्ध-वचनों का दैनिक जीवन में अभ्यास ही पटिपत्ति है। यही धर्म का वास्तविक प्रचार वाहन है। धम्म की वास्तविक लोकप्रियता राजकीय संरक्षण या लोगों द्वारा सैद्धांतिक पक्ष की स्वीकृति मात्र से नहीं थी, बल्कि इसलिए थी कि भगवान बुद्ध ने मन को शुद्ध करने की विद्या- विपस्सना साधना के अभ्यास की विधा स्पष्ट रूप से सिखायी।
                  <b>...</b>
                  <button type="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#model" id="btn9" onclick="showmsg(9)">
                    Read More
                  </button>
                </p>
                <div class="d-flex align-items-center icon">
                </div>
              </div>
            </div>
          </div>

        </div>
      </div>
    </div>

    <div id="msg1" style="display: none;">
      बुद्धत्व प्राप्ति के बाद एक बार भगवान बुद्ध राजगृह में अपने विशाल संघ के साथ विहार कर रहे थे। तब  महाराज शुद्धोदन ने उन्हें कपिलवस्तु आमंत्रित करने के लिए एक दूत भेजा। राजगृह पहुँच कर वो दूत भगवान के धम्म प्रभाव में प्रव्रजित होकर संघ में सम्मिलित हो गए। बहुत दिनों तक कोई समाचार नहीं आया, तो महाराज ने दूसरा दूतमण्डल भेजा। वो भी प्रव्रजित होकर भगवान के पावन संघ में शामिल हो गए। इस प्रकार कई दूत मण्डलों को निमंत्रण के लिए भेजने के विफल प्रयासों के बाद महाराज शुद्धोदन ने अपने सबसे विश्वसनीय आमात्य एवं सिद्धार्थ के बालसखा कालु उदायी को भेजा। कालु उदायी ने कहा- महाराज, एक शर्त पर जाऊंगा, कि मुझे भी प्रव्रज्या की अनुमति मिले...
      <br><br>
      पुत्र वियोग में व्याकुल महाराज ने कहा- प्रिय कालु उदायी, तुम्हारी सारी शर्तें मुझे स्वीकार हैं, बस मेरे बेटे को एक बार कपिलवस्तु ले आओ ।
      <br><br>
      कालु उदायी भी गए। पूर्व संकल्प के अनुसार वह भी प्रव्रज्या लेकर भगवान के संघ का अंग बन गए। फिर एक दिन अनुकूल अवसर देख कर वह भगवान के सम्मुख मनोरम मौसम का आख्यान करने लगे, यथा- भगवान, पेड़ों पर नयी पत्तियाँ आ गयी हैं, फूल खिल उठे हैं, अब न अधिक गर्मी है न अधिक ठण्ड है, वायु मलय हो गयी है, पक्षी कलरव कर रहे हैं, रास्ते भी साफ हो गए है, न अधिक सूखा है और न ही कीचड़ ।
      <br><br>
      यह सुन कर भगवान ने मुस्करा कर पूछा- कालु उदायी, किधर यात्रा करने की भूमिका बन रही है? भगवान को मनोनुकूल देख कर कालु उदायी ने भावुक कंठ से कहा- भगवान, आपके वृद्ध पिता आपको याद कर रहे हैं । इतना संकेत पर्याप्त था। भगवान बुद्ध ने भिक्खु संघ को कपिलवस्तु की ओर प्रस्थान करने का निर्देश दिया ।
      <br><br>
      भगवान पधार रहे हैं, यह खबर पूरे कपिलवस्तु में फैल गयी और हर कोई अपने-अपने तरीके से उनके स्वागत की तैयारी करने लगा, चारों ओर उत्सव नजर आने लगा। अन्ततः फाल्गुन की पूर्णिमा को भगवान कपिलवस्तु पधारे, न्यग्रोधाराम विहार में संघ के साथ प्रवास किया।
      <br><br>
      महाराज शुद्धोदन को प्रतिक्षा थी कि भगवान सीधे राजमहल आएंगे, लेकिन अगली सुबह कपिलवस्तु की विथिकाओं में अपने संघ के साथ भगवान को भिक्षाटन करते देख कर वह बड़े व्याकुल हो गए। वह महल की अटारी से उतर कर भागते हुए भगवान के सम्मुख आ गए और कहा- बेटा सिद्धार्थ! यह तुम क्या कर रहे हो?
      <br><br>
      महाराज शुद्धोदन अभी भी भगवान बुद्ध को 'बेटा सिद्धार्थ' ही समझ रहे थे। उन्होंने कहा- बेटा, हमारे वंश में आज तक किसी ने भिक्षा नहीं मांगी, यह हमारी कुल परम्परा नहीं है।
      <br><br>
      ‘लेकिन राजन!' भगवान बुद्ध ने उत्तर दिया, 'हमारे वंश में भिक्षा ही वृत्ति है, यह हमारी कुल परम्परा है।'
      <br><br>
      महाराज ने कहा- क्या तुम्हारा और मेरा वंश अलग-अलग है, क्या हमारी-तुम्हारी कुल परम्परा भिन्न है?
      <br><br>
      भगवान ने कहा- हाँ राजन, आपका राजवंश है, हमारा बुद्धवंश है, आपकी राज परम्परा है, हमारी बुद्धों की परम्परा है, हमसे पूर्व के बुद्धों ने भी भिक्षावृत्ति पर ही जीवनयापन किया है, यही बुद्धों की परम्परा है। तब महाराज शुद्धोदन हाथ जोड़ कर प्रार्थना करते हैं- अपने संघ के साथ कृपया कल के भोजनदान का पुण्यलाभ का अवसर मुझे दीजिए।
      <br><br>
      भगवान मौन रह कर महाराज के भोजनदान का निमंत्रण स्वीकार करते हैं। यह पहला अवसर नहीं है कि जब भगवान बुद्ध पूर्व के बुद्धों का स्मरण करते हैं, उनका सन्दर्भ देते हैं, बुद्धों की परम्परा के उदाहरण देते हैं, बल्कि धम्म साहित्य में, त्रिपिटक में, अनेक अवसरों पर भगवान बुद्ध पूर्व के बुद्धों का न केवल स्मरण करते हैं, वरन उनकी वन्दना भी करते हैं, उनके नाम-धाम-देश-काल इत्यादि का भी आख्यान करते हैं।
      <br><br>

      <p> ये च बुद्धा अतीता च ये च बुद्धा अनागता।</p>
      <p> पच्चुपन्ना च ये बुद्धा अहं वन्दामि सब्बदा।। </p>


      - 'ये च बुद्धा अतीता च' अर्थात अतीत में जितने बुद्ध हो गए हैं, 'ये च बुद्धा अनागता' अर्थात जितने अनागत अर्थात भविष्य में बुद्ध होंगे, 'पच्चुपन्ना च ये बुद्धा' अर्थात वर्तमान में जो बुद्ध हैं। वर्तमान से तात्पर्य वर्तमान कल्प से भी है, जैसे वर्तमान भद्रकल्प है, जिसमें गौतम बुद्ध हैं, हम सब लोग अभी इसी कल्प में विद्यमान हैं। 'अहं वन्दामि सब्बदा' अर्थात हम उन सबकी वन्दना करते हैं।
      <br><br>
      श्रमण परम्परा में बुद्ध की नहीं, बल्कि बुद्धों की पूजा, उनकी वन्दना, उनका स्मरण होता है, बुद्ध जो अतीत में हो गए, जो वर्तमान में हैं और जो भविष्य में होंगे, उन सब को नमन ।
      <br><br>
      सुत्त पिटक के खुद्दक निकाय में एक सम्पूर्ण ग्रंथ है- 'बुद्ध वंश' - जिसमें पूर्व के समस्त बुद्धों का वर्णन है, स्वयं भगवान बुद्ध के श्रीमुख से। भगवान बुद्ध महाराज शुद्धोदन के राजवंश की तुलना में अपने जिस बुद्ध वंश का सन्दर्भ देते हैं, इस ग्रंथ 'बुद्ध वंश' में भगवान बुद्ध अपने सम्पूर्ण वंश का सविस्तार वर्णन करते हैं, उनके नाम-धाम-देश-काल का स्मरण करते हैं, जैसे कोई अपने पुरखों का स्मरण करता है। वे पूर्व के बुद्धों की परम्परा स्मरण भी करते हैं और अनुसरण भी करते हैं। समस्त बुद्धों की कुछ समान चर्या होती है, जैसे सभी बुद्ध भिक्षा चर्या पर आश्रित रहते हैं, हर कल्प में जो बुद्ध होते हैं वे महाभिनिष्क्रमण करते हैं, कोई हाथी पर सवार होकर, कोई घोड़े पर, कोई पालकी, कोई रथ पर, जैसे दीपंकर बुद्ध, सुमन बुद्ध, सुमेध बुद्ध, पुष्प बुद्ध, सिखी बुद्ध एवं कोणागमन बुद्ध ने हाथी पर आरूढ़ होकर महाभिनिष्क्रमण किया। कौण्डिन्य बुद्ध, रेवत बुद्ध, पियदस्सी बुद्ध, विपस्सी बुद्ध एवं ककुछन्द बुद्ध ने रथ पर आरूढ़ होकर महाभिनिष्क्रमण किया; मंगल बुद्ध, सुजात बुद्ध, अत्थदस्सी बुद्ध, तिस्स बुद्ध एवं वर्तमान गौतम बुद्ध ने घोड़े पर सवार होकर महाभिनिष्क्रमण गृहत्याग किया तथा अनोमदस्सी बुद्ध, सिद्धार्थ बुद्ध, वेस्सभू बुद्ध ने शिविका अर्थात पालकी में बैठ कर महाभिनिष्क्रमण किया और नारद बुद्ध ने पैदल चल कर ही गृहत्याग कर दिया।
      <br><br>
      इसी प्रकार हर कल्प के बुद्ध किसी एक वृक्ष का आश्रय लेकर साधना करते हैं, उसी के नीचे बुद्धत्व लाभ करते हैं, उस कल्प में वह आश्रयी वृक्ष ही बोधिवृक्ष कहलाता है। जैसे अनोमदस्सी बुद्ध को अर्जुन के पेड़ के नीचे बुद्धत्व का लाभ हुआ, तो उनके कल्प में अर्जुन का पेड़ बोधिवृक्ष के रूप में पूजित हुआ, सुमेध बुद्ध ने कदम्ब के पेड़ का आश्रय लेकर साधना की, उसी की छाँव में बुद्धत्व का लाभ मिला, इसलिए उनके कल्प में कदम्ब का पेड़ बोधिवृक्ष कहलाया, विपस्सी बुद्ध ने पाटल वृक्ष अर्थात गुलाब के पास साधना की, उनके काल में गुलाब  बोधिवृक्ष हुआ, कोणागमन बुद्ध को उदुम्बर अर्थात गूलर के पेड़ के नीचे सम्बोधि लाभ हुआ, उनके काल में गूलर का पेड़ बोधिवृक्ष के रूप पूजनीय हुआ, वर्तमान बुद्ध का वृक्षाश्रय पीपल का पेड़ है, इसलिए अब के कल्प में,  जिसमें हम लोग है, पीपल का पेड़ बोधिवृक्ष है, काश्यप बुद्ध के कल्प में वट वृक्ष बोधिवृक्ष था, इत्यादि।
      <br><br>
      हर कल्प के बुद्ध धम्मचक्कप्पवत्तन करते हैं। भिन्नताएं एवं समानताएं होते हुए भी बुद्धों का प्रताप समान होता है, उनमें न्यूनता-अधिकता नहीं मानी जाती।
      <br><br>
      पूर्वजों का स्मरण करने पर उनसे प्रेरणा मिलती है, उत्साह मिलता है, आत्मविश्वास दृढ़ होता है, इसलिए हर कल्प के बुद्ध न केवल पूर्व के बुद्धों का स्मरण करते हैं वरन भविष्य के भावी बुद्ध की घोषणा भी करते हैं। दीपंकर बुद्ध सहित पूर्व के चौबीस बुद्धों ने वर्तमान गौतम बुद्ध के भद्रकल्प, वर्तमान युग में, होने की घोषणा की थी और भगवान गौतम बुद्ध ने भी इसी परम्परा का निर्वहन करते हुए आगामी मैत्रेय बुद्ध की घोषणा की है:
      <br><br>
      <div>“अहमेतरहि सम्बुद्धो, मेत्तेय्यो चा पि हेस्सति”</div>

      - अर्थात अभी मैं सम्बुद्ध हूँ और मैत्रेय बुद्ध आगे होंगे।<br>

      बुद्ध वाणी मे वर्तमान गौतम बुद्ध सहित अट्ठाईस बुद्धों का उल्लेख है:<br>

      1.तण्हंकर बुद्ध,
      2. मेधंकर बुद्ध,
      3. सरनंकर बुद्ध,
      4. दीपंकर बुद्ध,
      5. कौण्डिन्य बुद्ध,
      6. मंगल बुद्ध,
      7. सुमन बुद्ध,
      8. रेवत बुद्ध,
      9. सोभित बुद्ध,
      10. अनोमदस्सी बुद्ध,
      11. पद्म बुद्ध,
      12. नारद बुद्ध,
      13. पद्मोत्तर बुद्ध,
      14. सुमेध बुद्ध,
      15. सुजात बुद्ध,
      16. पियदस्सी बुद्ध,
      17. अत्थदस्सी बुद्ध,
      18. धम्मदस्सी बुद्ध,
      19. सिद्धार्थ बुद्ध,
      20. तिस्स बुद्ध,
      21. पुष्प बुद्ध,
      22. विपस्सी बुद्ध,
      23. सिखी बुद्ध,
      24. वेस्सभू बुद्ध,
      25. ककुछन्द बुद्ध,
      26. कोणागमन बुद्ध,
      27. कस्सप बुद्ध,
      28. गौतम बुद्ध ।
      <br><br>
      भगवान गौतम बुद्ध के जन्म के समय असित नाम के एक ऋषि हिमालय से उतर कर आए थे, राजा शुद्धोदन के राजमहल, नवजात शिशु का दर्शन करने। जब उन्होंने बालक सिद्धार्थ को गोदी में लिया, तो उसके शरीर के बत्तीस लक्षणों को देख कर वे प्रसन्न होकर मुस्कराने लगे कि यह बालक पूर्ण आयु पाने पर बुद्धत्व लाभ करेगा, बुद्ध होगा। लेकिन अगले ही पल उनकी आँखों में आंसू छलक आए, वह रोने लगे। हैरान राजा ने पूछा- ऋषिवर, पहले आप मुस्कराए और अब रो रहे हैं? कोई बात अनिष्टकारक है क्या?
      <br><br>
      ऋषि असित ने कहा कि इस बालक के शरीर के लक्षण बता रहे हैं कि बड़ा होकर यह सम्यक सम्बुद्ध होगा। इस बात से प्रसन्न होकर मैं मुस्कराया, लेकिन रो रहा हूँ यह सोचकर कि जब यह सम्यक सम्बुद्ध होगा, तब तक मैं जीवित नहीं रहूँगा, उनके चरणों में बैठ कर मैं धम्म देशना नहीं सुन सकूँगा। यह सोचकर मन दुःखी हुआ। इसीलिए रो रहा हूँ।
      <br><br>
      बुद्धों की शरण में बैठ कर धम्म देशना सुनने, उनकी पूजा-वन्दना करने, उनका सेवा-सत्कार करने, उनको भोजनदान-चीवरदान देने की अभीप्सा बड़े-बड़े ऋषि-मुनियों में भी होती है। वे भी प्रत्यक्ष बुद्ध को शरणगमन करने की कामना करते हैं, तो फिर आमजन का तो कहना ही क्या!
      <br><br>
      इसिलिए बुद्धों की परम्परा रही है कि वे पूर्व के बुद्धों का स्मरण-गुणगान-कीर्तिनाद करते हैं और भावी बुद्ध की घोषणा भी करते हैं, यह आश्वासन भी देते हैं कि जो रोग-शोक-आयुक्षय के कारण अभी बुद्ध दर्शन से वंचित रह गए हैं, वे भावी बुद्ध के समय उनके दर्शन का पुण्य लाभ पा सकते हैं, उनसे प्रत्यक्ष धम्मदेशना सुन सकते हैं, उनको भोजन-चीवर-औषधि दान आदि करके पुण्य लाभ कर सकते हैं, जो अभी चूक गए हैं, वे भी अपनी साधना में लगे रहें, पारमिताओं को पुष्ट करते हुए, इतना पुण्य लाभ करें कि भावी बुद्ध के समय सान्निध्य लाभ मिले। बुद्धों के वचनों में आशावाद है। आशावाद से ही जीवन चल रहा है, दुनिया चल रही है। बुद्धों का आश्वासन झूठा नहीं होता- 'धुवं बुद्धो भविस्सति' अर्थात यह ध्रुव सत्य है कि भविष्य में भी बुद्ध होंगे।
      <br><br>
      भगवान गौतम बुद्ध के भी ध्रुव वचन है 'भविष्य में मैत्रेय बुद्ध होंगे।' दीघनिकाय के चकवत्ति सुत्त में मैत्रेय बुद्ध का जन्म स्थान तक का भी उल्लेख है। इस सुत्त का संगायन भगवान ने मगध देश में बिहार करते समय भिक्खुओं के समक्ष किया था। इस सुत्त में उल्लेख है कि वर्तमान का वाराणसी नगर ही कालान्तर में केतुमति नगर के नाम से जाना जाएगा। इसी नगर में- मनुस्सेसु मेत्तेयो नाम भगवा- मनुष्यों में मैत्रेय नाम के भगवान बुद्ध होंगे, वे सम्यक सम्बुद्ध होंगे-
      <br><br>
      "मनुस्सेसु मेत्तेयो नाम भगवा लोके उप्पज्जिस्सति अरहं सम्मासम्बुद्धो विज्जाचरणसम्पन्नो सुगतो लोकविदु अनुत्तरो पुरिसदम्मसारथि सत्था देव मनुस्सानं बुद्धो भगवा, सेय्यथापाहमेतरहि लोके उप्पन्नो अरहं सम्मासम्बुद्धो विज्जाचरणसम्पन्नो सुगतो लोकविदु अनुत्तरो पुरिसदम्मसारथि सत्था देवमनुस्सानं बुद्धो भगवा। सो इमं लोकं सदेवकं समारकं सब्रह्मकं सस्समणब्राह्मणिं पजं सदेवमनुस्सं सयं अभिञ्ञा सच्छिकत्वा पवेदेस्सति, सेय्यथापाहमेतरहि इमं लोकं सदेवकं समारकं सब्रह्मकं सस्समणब्राह्मणिं पजं सदेवमनुस्सं सयं अभिञ्ञा सच्छिकत्वा पवेदेमि। सो धम्मं देसेस्सति आदिकल्याणं मञ्झेकल्याणं परियोसानकल्याणं सात्थं सब्यञ्जनं, केवलपरिपुण्णं परिसुद्धं ब्रह्मचरियं पकासेति, सेय्यथापाहमेतरहि धम्मं देसेमि आदिकल्याणं मज्झेकल्याणं परियोसानकल्याणं सात्थं सब्यञ्जनं, केवलपरिपुण्णं ब्रह्मचरियं पकासेति; सेय्यथापाहमेतरहि धम्मं देसेमि आदिकल्याणं मज्झेकल्याणं परियोसानकल्याणं सात्थं सब्यञ्जनं केवलपरिपुण्णं परिसुद्धं ब्रह्मचरियं पकासेति। सो अनेकसहस्सं भिक्खुसंघ परिहरिस्सति, सेय्यथापाहमेतरहि अनेकसतं भिक्खुसंघ परिहरामि।”
      <br><br>
      - लोक में मनुष्यों में मैत्रेय नाम के भगवान होंगे, वे अरहत, सम्यक सम्बुद्ध होंगे, वे विद्याचरण सम्पन्न, सुगत, लोकविदु, अनुत्तर होंगे, बिगड़े हुए घोड़ों को साधने वाले कुशल सारथी की तरह वे देवों और मनुष्यों को साधने वाले भगवान बुद्ध होंगे, जैसे अभी मैं लोक में उत्पन्न हुआ हूँ, अरहत, सम्यक सम्बुद्ध हूँ, विद्याचरण में सम्पन्न, सुगत्, लोकविदु, अनुत्तर, देवों-मनुष्यों को साधने वाला भगवान हूँ, ऐसे ही वे भी इस लोक में मार, ब्रह्मा, श्रमण, ब्राह्मण, समस्त मनुष्यों को अभिज्ञान कराएंगे, देशना देंगे, जैसे अभी मैं इस लोक में मार, ब्रह्मा, श्रमण, ब्राह्मण, समस्त मनुष्यों को अभिज्ञान कराता हूँ, उपदेश देता हूँ, ऐसे ही वे भी जो धम्म देशना देंगे, वह भी आदि में कल्याणकारी होगी, मध्य में कल्याणकारी होगी, अपने समस्त व्यंजनों सहित अन्त तक कल्याणकारी होगी, जिससे परिपूर्ण कैवल्य सम्बोधि एवं परिशुद्ध ब्रह्मचर्य प्रकाशित होगा, जैसे अभी मैं धम्म उपदेशता हूँ, जो आदि कल्याणकारी है, मध्य कल्याणकारी है, समस्त व्यंजनों सहित अन्त तक कल्याणकारी है, कैवल्य ज्ञान, सम्बोधि और परिशुद्ध ब्रह्मचर्य को प्रकाशित करने वाला है। वह अनेक सहस्र भिक्खु संघ के साथ विहार करेंगे, जैसे अभी मैं सैकड़ों भिक्खुओं के संघ के साथ विहार करता हूँ।
      <br><br>
      इससे अधिक प्रामाणिक आश्वासन क्या हो सकता है! दुनिया के करोड़ों-करोड़ बौद्ध उपासक-उपासिकाएं, भिक्खु-भिक्खुनियाँ आज भी सिर्फ इस अभीप्सा में साधनारत हैं, पारमिताओं का अभ्यास पुष्ट कर रहे हैं, लोक उपकारी पुण्य कार्य कर रहे हैं कि वे भी इतना पुण्य अर्जित कर सकें कि जब कभी लोक में मैत्रेय बुद्ध का जन्म हो, तो वह उनके युग में जन्म लेकर, उनके सम्मुख धम्म देशना सुन सकें, उनके दर्शन कर सकें, उनकी पूजा-वन्दना कर सकें, उनको यथावश्यक, यथासामर्थ्य दान देने का सुअवसर पा सके, अन्ततः सम्बोधि लाभ कर सकें।
      <br><br>
      कहते हैं कि वर्तमान बुद्ध कभी भी गुरु रूप में नहीं रहना चाहते थे। उन्होंने प्राणिमात्र के प्रति मैत्री भाव से धम्म देशना देने का निर्णय लिया था, लेकिन प्राणिमात्र ने उन्हें मित्र नहीं गुरु मान लिया। इसलिए आगामी बुद्ध मित्र रूप में होंगे, इसलिए उनका नाम मैत्रेय बुद्ध होगा। वह मित्र रूप में धम्म देशना देंगे। उनका संघ मित्र संघ होगा, न केवल भिक्खु-भिक्खुनियों का वरन उपासक-उपासिकाओं का भी। दुनिया के करोड़ों-करोड़ श्रद्धालु उपसाक-उपासिकाएं, भिक्खु-भिक्खुनियाँ मैत्रेय बुद्ध की प्रतीक्षा में, उनके दर्शन की अभीप्सा में साधनारत हैं, पारमिताओं की साधना कर रहे हैं। मैत्री भी दस परिमिताओं में एक पारमिता है।
      <br><br>
      आगामी बुद्ध के आगमन की सबसे बड़ी पूर्व तैयारी होगी कि इस धरती को हिंसामुक्त, आतंकमुक्त, अनाचारमुक्त, द्वेष और भेदभाव मुक्त कर मैत्रीपूर्ण बनाना, क्योंकि बुद्ध के वचन है- मैत्री सम्पूर्ण धम्म है!
      <br><br>
      नमो बुद्धाय 🙏🙏🙏<br>
      <b>Ref:</b> बुद्ध वंश
    </div>

    <div id="msg2" style="display: none;">
      महाराज मिलिन्द ने भन्ते नागसेेन से पुछा- "भगवान का विमुक्ति रत्न क्या है?"

      “महाराज! विमुक्ति-रत्न अर्हत-पद को कहते हैं। अर्हत हो कर भिक्खु विमुक्ति-रत्न से शोभित हो जाता है।

      "महाराज! जैसे कोई पुरुष मोती, मणि, सोने और मूंगे के आभूषणों से आभूषित हो। अगर, तगर, तालिसक, लाल चन्दन इत्यादि के लेप से अपने गात्र को सुगन्धित बना ले।
      नाग, पुनाग, साल सलल, चम्पक, जूही, अतिमुक्तक, गुलाब, कमल, मालती, मल्लिका इत्यादि फूलों के हार से अपने को सजा ले। तो वह पुरुष दूसरे लोगों से कितना बढ़-चढ़ कर शोभा देगा, अच्छा लगेगा, चमकेगा और सुहावना लगेगा।

      महाराज! इसी तरह, अर्हत-पद पा कर क्षीणासव भिक्खु विमुक्ति-रत्न से सज दूसरे भिक्खुओं से बहुत बढ़-चढ़ कर शोभता है, चमकता है और सुहावना लगता है, वह क्यों?

      क्योंकि सभी आभूषणों में यही सर्वोच्च आभूषण है जो कि यह विमुक्ति-रत्न है। महाराज! इसी को भगवान का विमुक्ति-रत्न कहते हैं।"
      "सिर में मणि को लगा लेने से घर के सभी लोग स्वामी ही की ओर देखने लगते हैं। विमुक्ति-रत्न सिर में लगा लेने से देवता लोग भी उसी की ओर देखने लगते हैं।"

      नमो बुद्धाय🙏🙏🙏<br>
      <b>Ref:</b> मिलिन्द प्रश्न
    </div>

    <div id="msg3" style="display: none;">
      गौतम बुद्ध न कपोलकल्पित है या न किसी धूर्त लोगों की कलम से निकले हुए है। भगवान  बुद्ध और उनके धम्म को संरक्षित रखने के लिए देवानांप्रिय प्रियदर्शी सम्राट अशोक ने जो कदम उठाए उनकी बदोलत आज भगवान बुद्ध और उनके धम्म को कोई कल्पित नहि कह सकता है। अपने विशाल साम्राज्य में अशोक ने 84000 स्तूप बनवाए और बुद्ध के धम्म स्कंंधों को शीलापट व शीला स्तंभ पर अभिलेख खुदवाए। अबतक मिले हुए पुरातत्व अवशेष के अनुसार, सम्राट अशोक  द्वारा शिलाओं, स्तंभों, गुफाओं  पर उत्कीर्ण  अभिलेखों की संख्या 42 तक पहुंच चुकी है। इनमें से भारत में 36, 2 नेपाल  में,  2 पाकिस्तान में और  2 अफगानिस्तान में पाए गए  है।वे अभिलेख आज भी बुद्ध और उनके धम्म की ऐतिहासिकता प्रमाणित करते है।
      <br><br>
      धम्म प्रचार व प्रसार के लिए शीला अभिलेखों खुदवा कर सम्राट अशोक रुके नहि। उन्होंने अपने साम्राज्य के भीतर ही नहि बल्कि विदेशों में धम्म प्रचारार्थ धम्म दूत भेजे।
      <br><br>
      अशोक ने अपने शासनकाल में  पाटलिपुत्र में एक धम्म संगीति  भी बुलाई थी जो ऐतिहासिक है। भगवान बुद्ध के महापरिनिर्वाण के पश्चात यह तीसरी  संगीति थी। यह संगीति ईसा पूर्व 251में सम्पन्न  हुई। इसकी अध्यक्षता मोग्गलिपुत्त तिस्स ने की थी।  इस संगीति  के उपरान्त  विदेशों में धम्म प्रचारार्थ के लिए अनेक स्थविरों को भेजा गया जिसके फलस्वरूप ही एशियाई  देशों में बुद्ध धम्म पहुंता। परिणामस्वरूप आज भी उन देशों में धम्म में विश्वास रखने वाले बौद्धों की जन संख्या बडी तादाद में है।
      <br><br>
      देवानांप्रिय प्रियदर्शी सम्राट अशोक ने किस देश में कौन स्थविर को धम्म के प्रचार के लिए भेजे गए उसकी जानकारी:
      <br><br>
      1) मज्झिन्तिक स्थविर- काश्मीर एवं गंधार

      2) महारक्षित स्थविर- यवन (यूनान)

      3) मज्झिम स्थविर- हिमालय देश

      4) धम्मरक्षित स्थविर- अपरांतक

      5) महाधम्मरक्षित स्थविर- महाराष्ट्र

      6) महादेव स्थविर- महिषमंडल ( मैसूर या मांधाता)

      7) रक्षित स्थविर- वनवासी (उत्तर कन्नड)

      8) सोण स्थविर और  उत्तर स्थविर- सुवर्णभूमि ( पेगू  तथा मौलमीन)

      9) महेन्द्र स्थविर- श्रीलंका (सिंहल)

      10) संघमित्रा भिकखुणी - श्रीलंका ( सिंहल)
      <br><br>
      सम्राट ने अपने पुत्र  महेंद्र  और  पुत्री संघमित्रा को धम्म प्रचार के लिए समर्पित किए इसलिए सच्चे अर्थ में वह धम्म दायद है ।
      <br><br>
      देवानांप्रिय प्रियदर्शी सम्राट अशोक के इस महान कार्य के लिए पूरा बौद्ध जगत उनका ऋणी है।
      <br><br>
      नमो बुद्धाय🙏🙏🙏
    </div>

    <div id="msg4" style="display: none;">
      बोधिपक्षिय धम्म कितने है?
      <br>
      बोधिपक्षिय धम्म 37 है।
      <br>
      कौन से 37?
      <br>
      (1) चार सतीपठ्ठान:<br>
      - कायानुपस्सी - कायानुदर्शन
      - वेदनानुपस्सी - वेदनानुदर्शन -
      - चित्तानुपस्सी - चित्तानुदर्शन
      - धम्मानुपस्सी- धम्मानुदर्शन
      <br>
      (2) चार सम्यक प्रहाण:<br>
      - अनोत्पन्न पुण्यकर्मों को उत्पन्न करना जो अपने अंदर अच्छाई नहीं है, वो उत्पन्न हो।

      - उत्पन्न पुण्यकर्मों की वृद्धि करना जो अपने अंदर अच्छाई है उसका अधिक से अधिक संवर्धन करे।
      - उत्पन्न पाप कर्मों का नाश करना जो अपने अंदर बुराई है उसको नष्ट करे।
      - अनोत्पन्न पाप कर्मो को न उत्पन्न होने देना जो अपने अंदर बुराई नहीं है वो उत्पन्न न होने पाए।
      <br>
      (3) चार ऋद्धि पाद:<br>
      - छन्द ऋद्धि , शुभ-मंगल इच्छा उत्पन्न करना (चुनाव करना)
      - वीर्य ऋद्धि, मंगल उत्साह उत्पन्न करना।
      - चित्त ऋद्धि, प्रशांत चित्त का उत्पन्न करना। (समाधि)
      - मीमांसा ऋद्धि, विश्लेषण कौशल्य का उत्पन्न करना।
      ये चार ऋद्धि पाद हैं।
      <br>
      (4) पांच इन्द्रियां और (5) पांच बल:<br>

      - श्रद्धा इन्द्रिय + बल
      - वीर्य इन्द्रिय + बल
      - स्मृति इन्द्रिय + बल
      - समाधि-इन्द्रिय + बल
      - प्रज्ञा इन्द्रिय + बल
      ये 5 इन्द्रिय और 5 बल हैं।
      <br>
      (6) सात सम्बोध्यंग:<br>

      - सती (स्मृति) सम्बोध्यंग
      - धम्म विचय (विश्लेषण) सम्बोध्यंग
      - वीर्य सम्बोध्यंग,परिश्रम
      - प्रीति सम्बोध्यंग
      - प्रश्रब्धि सम्बोध्यंग( प्रशांति) सम्बोध्यंग
      - समाधि सम्बोध्यंग
      - उपेक्षा सम्बोध्यंग
      <br>
      ये 7 सात प्रकार के सम्बोध्यंग हैं
      <br>
      (7) आठ अरिय आष्टांगिक मार्ग :<br>

      - सम्यक दृष्टि (दृष्टिकोण)
      - सम्यक संकल्प
      - सम्यक वाणी
      - सम्यक कर्मांत
      - सम्यक आजीविका
      - सम्यक व्यायाम
      - सम्यक स्मृति
      - सम्यक समाधि
      <br>
      ये आठ अरिय आष्टांगिक मार्ग हैं।
      <br>
      ये सब मिलकर 37 बोधिपक्षिय धम्म हैं।
      <br>
      नमो बुद्धाय🙏🙏🙏
    </div>

    <div id="msg5" style="display: none;">
      अनाथपिण्डिक के द्वारा बनाया गया जेतवन विहार में तथागत विहार करते थे। उस समय एक युवक ने प्रव्रज्या ग्रहण की और उसका नाम तिस्स रखा गया। तिस्स को दूसरे की निंदा करने की बुरी आदत थी। वह अनाथपिण्डिक  और  विशाखा  जैसे महादानियों की भी निंदा करता था। कारण हो या ना हो वह दूसरे की निंदा करना चुकता नहीं था। वह निंदा करने का कारण खोज लेता था। कोई कारण न मिले तो स्वयं कारण निर्मित कर लेता था। कोई  दान दे, तो निंदा करता था और  कोई दान दे तो कहता,-" अरे! यह भी कोई दान है! दान देना सीखना हो तो मेरे परिवार  से सीखो।" वह अपने परिवार की प्रशंसा में लगा रहता, शेष सारे संसार की निंदा।
      <br><br>
      तिस्स की यह बुरी आदत की जानकारी भगवान के पास पहुंची।
      भगवान ने तिस्स की उपस्थित में कहा-
      "भिक्खुओ! दूसरों की निंदा दूसरों को नहीं अपना ही अहित करती है। यह दूसरों के बहाने अपनी छाती में ही छुरा धोंपने जैसा है।"
      तिस्स भगवान की वाणी को सुन रहा था। वह तत्क्षण बोल उठा,- कोई दान न दे,तो हम कैसा भाव रखें? कोई  दुत्कारा, तो हम कैसा भाव रखे? कोई हमें तो दान नहीं देवे और  दूसरों को दान दे, तो हम कैसा भाव रखें?
      <br><br>
      तस्स के प्रश्न के उत्तर में भगवान ने यह कहा-
      <br><br>
      "ददन्ति ये यथासद्धं,
      यथापसादनं जनो।
      तत्थ यो च  मङ्कु होति,
      परेसं पानभोजने।
      न सो दिवा वा रत्तिं वा समाधिं अधिगच्छति। ।"
      - धम्मपद
      - लोग अपनी श्रद्धा भक्ति के अनुसार दान देते हैं। दूसरों  के खाने पीने को देख जो सह नहीं सकता, वह दिन या रात कभी भी एकाग्रता को प्राप्त नहीं  हो सकता।
      <br><br>
      "यस्स चे तं समुच्छिन्नं  मूलधच्चं समूहतं।
      स वे दिवा वा रत्तिं वा समाधिं अधिगच्छति। ।"
      - धम्मपद
      - जिसकी ऐसी ( उक्त जैसी) मनोवृति उच्छिन्न हो गई है, समूल नष्ट हो गई है, वही रात और  दिन ( सर्वदा ) एकाग्रता को प्राप्त करता है।
      <br><br>
      भिक्खुओ! लोग अपनी श्रद्धा और  प्रसन्नता के अनुसार दान देते हैं। किसी को तुम्हें देना चाहिए, ऐसा नहीं है, ऐसी बाध्यता नहीं है, जिनकी जितनी श्रद्धा होगी, जिनकी जितनी प्रसन्नता होगी, लोग उतना ही देंगे, उसी हिसाब से देंगे। उनके पास कितना है और  कितना दिया, यह सवाल नहीं है। दूसरों की हैसियत  को देखकर, दूसरों के खाने-पीने को देख, जो सह नहीं सकता, वह दिन-रात न तो दिन में और न ही  रात में कभी भी समाधि को प्राप्त नहीं कर सकता है, एकाग्रचित नहीं हो सकता है। लेकिन  जिस की ऐसी मनोवृत्ति  उच्छिन्न  हो गई  है, समूल  नष्ट हो गई है, वह दिन हो या रात एकाग्रचित होता है।
      <br><br>
      तथागत ने कहा-
      <br>
      " भिक्खुओ! यदि कोई भिक्खु चुटकी बजाने भर भी ही-<br>

      पृथ्वी-कसिण की भावना करता है,<br>

      जल-कसिण की भावना करता है,<br>

      तेज ( अग्नि )- कसिण की भावना करता है,<br>

      वायु-कसिण की भावना करता है,<br>

      नील-कसिण की भावना करता है,<br>

      पीत-कसिण की भावना करता है,<br>

      लोहित-कसिण की भावना करता है,<br>

      अवदात ( श्वेत ) -कसिण की भावना करता है,<br>

      आकाश-कसिण की भावना करता है,<br>

      विज्ञान-कसिण की भावना करता है,<br>
      <br><br>
      इस प्रकार के भिक्खु को, हे भिक्खुओ! अरिक्तध्यानी कहते हैं, शास्ता के अनुशासन में रहने वाला, उनके उपदेश के अनुसार आचरण करने वाला वह भिक्षु व्यर्थ ही राष्ट्र- पिंड खाने वाला नहीं होता।"
      <br><br>
      उसी तरह, यदि कोई भिक्खु चुटकी बजाने भर भी ही-<br>

      "सम्यक -दृष्टि की भावना करता है,<br>

      सम्यक- संकल्प की भावना करता है,<br>

      सम्यक- वाणी की भावना करता है,<br>

      सम्यक- कर्मान्त की भावना करता है,<br>

      सम्यक- आजीविका की भावना करता है,<br>

      सम्यक- व्यायाम की भावना करता है,<br>

      सम्यक- स्मृति की भावना करता है,<br>

      सम्यक-समाधि की भावना करता है,<br>
      <br><br>
      इस प्रकार के भिक्खु को, हे भिक्खुओ! अरिक्तध्यानी कहते हैं, शास्ता के अनुशासन में रहने वाला, उनके उपदेश के अनुसार आचरण करने वाला वह भिक्खु व्यर्थ ही राष्ट्र- पिंड खाने वाला नहीं होता।"
      <br><br>
      नमो बुद्धाय🙏🙏🙏<br><br>
      <b>Ref:<b> क्षणिक वग्ग: अंगुत्तर निकाय
    </div>

    <div id="msg6" style="display: none;">
      भगवान गौतमबुद्ध से प्रश्न पूछा गया कि क्या आप सब पर समान रूप से करूणा भाव रखते हैं, यदि हां तो किसी को बहुत लाभ होता है, किसी को मध्यम तो कोई कोई धर्म लाभ से वंचित रह जाता है, ऐसा क्यों? आपकी मंगलमय करूणा का प्रभाव सब पर एक जैसा क्यों नहीं होता?
      <br><br>
      भगवान ने उसे एक किसान का उदाहरण देते हुए समझाया कि उसके पास तीन तरह की जमीन है—
      1) बहुत उपजाऊ
      2) मध्यम उपजाऊ
      3) बिल्कुल उसर-बंजर।
      <br><br>
      ऐसे में वह सबसे पहले उपजाऊ जमीन पर बीज डालता है, उसके बाद मध्यम में और सबसे अंत में उसर-बंजर में। बीज वही है और उतनी ही मेहनत और लगन से डाला जाता है। लेकिन फसल एक सी नहीं होती।
      <br><br>
      इस प्रकार मेरे पास भी तीन प्रकार के लोग धर्म सीखने आते हैं। एक तो बहुत गंभीर साधक साधिकायें, जो उपजाऊ जमीन के समान है। उनमें जो बीज पडेगा, तुरंत फलदायक होगा। क्योंकि वे पूरी श्रद्धा और लगन से काम में लग जाते हैं। दूसरे सामान्य गृहस्थ उपासक उपासिकायें जो अपने दैनिक सांसारिक कामों में लगे रहते हुए भी धर्म सीखते हैं। वे मध्यम खेत के समान है उनमें श्रद्धा और लगन तो है परंतु जीवन जगत की अनेक कठिनाइयां है। फिर भी वे धर्म मार्ग पर चलकर अपना मंगल साधते हैं। तीसरे कुछ ऎसे लोग हैं जो कर्म कांडों व अन्य जंजालों में उलझे होने के कारण धर्म को ठीक से ग्रहण नहीं करते। कोई कोई केवल सुन कर चला जाता है जरा भी अभ्यास नहीं करता तो वह धर्म से सदा वंचित रह जाता है। परंतु मेरी करुणा उनसब के लिए सदैव उतनी ही रहती है।
      <br><br>
      भगवान ने एक और उदाहरण देते हुए समझाया कि किसी के पास तीन घडे हों। एक बिल्कुल छिद्र रहित, दूसरा सुक्ष्म छिद्र वाला और तीसरा बड़े छिद्र वाला। वह सबसे पहले बिना छिद्र वाले घडे में पानी भरता है, जो दिन भर उसके काम आता है। फिर दूसरे में भरता है, भले ही दिन भर न चले पर कुछ समय तक तो उसके काम आता है। तीसरा घडा वह इसलिए भरता है कि जितना भी पानी एकत्र हो वह उसके नहाने व बर्तन धोने के काम आ जाये।
      <br><br>
      बहुत गंभीर साधक साधिकायें पहले घडे के समान है। दूसरे घडे के समान सामान्य उपासक उपासिकायें है जो कठिनाई होते हुए भी धर्म धारण करते हैं। अन्यान्य कर्म कांडों में उलझे हुए लोग तीसरे घडे के समान है। वे जितना अभ्यास करेंगे, जितना ग्रहण करेंगे बस उतना ही लाभ होगा यद्यपि मेरी करूणा उनके प्रति भी उतनी ही है।
      <br><br>
      भगवान द्वारा उपदेशित इन उदाहरणों से सबक लेकर साधकों हम भी धर्म मार्ग पर उपजाऊ क्षेत्र बन कर, श्रद्धा और लगन के साथ पांचों शीलों का कड़ाई से पालन करते हुए, सम्यक समाधि पुष्ट करें और अनित्यबोधिनी प्रज्ञा का गहराई से अभ्यास करते हुए अपने सदाचरण के बल पर अपनी सुगति निश्चित करें।
      <br><br>
      तथागत बुद्ध ने कहा-
      भिक्खुओ,  कृषक- गृहपति  के लिए ये तीन  अविलंब  करने योग्य  कर्तव्य  हैं।
      <br><br>
      कौन से तीन?
      <br><br>
      यहां, भिक्खुओ, कृषक-गृहपति जल्दी-जल्दी  खेत में हल जोत कर उसकी मिट्टी ठीक करता हैं, जल्दी- जल्दी खेत में हल जोत कर ठीक करके बीजों को बोता हैं, तथा जल्दी- जल्दी  बीजों बोकर जल्दी-जल्दी पानी देता भी हैं, बंद भी करता हैं। भिक्खुओ,  ये तीन कृषक- गृहपति के अविलंब करने योग्य  कर्तव्य हैं ।
      <br><br>
      भिक्खुओ, उस कृषक - गृहपति के पास ऐसा कोई  ॠद्धि बल या प्रताप नहीं हैं, जिससे वह यह कर सके कि आज ही मेरे धान उग जाए, कल दाने पड जाए और  परसों पक जाए।
      भिक्खुओ, समय आता हैं जब उस कृषक- गृहपति के वे धान उगते हैं, उनमें दाने पडते भी हैं और  वे पकते भी हैं ।
      <br><br>
      इस प्रकार भिक्खुओ,  ये तीन  भिक्खु के करने योग्य  कर्तव्य हैं।
      <br><br>
      कौन से तीन?
      <br><br>
      अधिशील -संबंधी शिक्षा का ग्रहण,
      अधिचित्त- संबंधी शिक्षा का ग्रहण,
      तथा अधिप्रज्ञा- संबंधी शिक्षा का ग्रहण।
      <br><br>
      भिक्खुओ, ये तीन भिक्खु के अविलंब  करने योग्य  कर्तव्य  हैं।
      <br><br>
      भिक्खुओ, उस भिक्खु का ऐसा कोई  ॠद्धि  बल या प्रताप  नहीं होता जिससे वह कह सके कि आज ही उपादान  रहित  हो मेरा चित्त आस्रव विमुक्त  हो जाए, कल हो जाए अथवा परसों हो जाए। लेकिन भिक्खुओ, समय आता है जब अधिशील, अधिचित्त तथा अधिप्रज्ञा संबंधी शिक्षाओं  के अनुसार आचरण करते- करते उपादान  रहित हो चित्त आस्रव विमुक्त  हो जाता है।
      <br><br>
      इसलिए  भिक्खुओ, ठीक  इस प्रकार सीखना  चाहिए- श्रेष्ठतर शील -शिक्षा के लिए  हमारी तीव्र  इच्छा होगी, क्षेष्ठतर  चित्त- शिक्षा के लिए हमारी तीव्र  इच्छा होगी, क्षेष्ठतर  प्रज्ञा- शिक्षा के लिए  हमारी  तीव्र  इच्छा होगी। भिक्खुओ,  इसी प्रकार  तुम्हें  सीखना चाहिए।
      <br><br>
      नमो बुद्धाय🙏🙏🙏<br>
      <b> Ref:</b>अत्यावश्यक  सुत्त: अंगुत्तर निकाय

    </div>

    <div id="msg7" style="display: none;">
      भिक्षुओ ! सोने के पांच मल होते हैं, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न व्यवहार के योग्य होता है। <br><br>

      कौन से पांच ?<br><br>

      भिक्षुओ ! काला लोहा (अयसक) सोना का मल होता है, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है और न व्यवहार के योग्य होता है।<br><br>

      लोहा सोना का मल होता है, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है और न व्यवहार के योग्य होता है।<br><br>

      त्रिपु (जस्ता) सोना का मल होता है,
      जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है और न व्यवहार के योग्य होता है।<br><br>

      सीसा सोना का मल होता है, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है और न व्यवहार के योग्य होता है।<br><br>

      चाँदी सोना का मल होता है, जिनसे मैला हो सोना न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है और न व्यवहार के योग्य होता है।<br><br>

      भिक्षुओ ! सोने के यही पांच मल होते हैं।<br><br>

      भिक्षुओ ! वैसे ही, चित्त के पांच मल (उपक्लेश) होते हैं, जिनसे मैला हो चित्त न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न अश्रव के क्षय करने के योग्य होता है।
      <br><br>
      कौन से पांच ?
      <br><br>
      भिक्षुओ ! काम-छन्द चित्त का मल है,
      जिनसे मैला हो चित्त न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न अश्रव के क्षय करने के योग्य होता है।
      <br><br>
      व्यापाद'(क्रोध, द्वेष) चित्त जिनसे मैला हो चित्त न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न अश्रव के क्षय करने के योग्य होता है।
      <br><br>
      आलस्य चित्त 'जिनसे मैला हो चित्त न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न अश्रव के क्षय करने के योग्य होता है।
      <br><br>
      औद्धत्य-कौकृत्य (उद्देग-खेद) चित्त जिनसे मैला हो चित्त न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न अश्रव के क्षय करने के योग्य होता है।
      <br><br>
      विचिकित्सा''(संदेह) चित्त जिनसे मैला हो चित्त न मृदु होता है, न सुन्दर होता है, न चमक वाला होता है, और न अश्रव के क्षय करने के योग्य होता है।
      <br><br>
      भिक्षुओ ! यही चित्त के पांच मल हैं।
      <br><br>
      नमो बुद्धाय 🙏🙏🙏<br>
      Ref: पठम किलेस सुत्त: संयुक्तनिकाय
    </div>

    <div id="msg8" style="display: none;">
      2568 वर्ष पूर्व वैशाख पूर्णिमा की रात्रि को सिद्धार्थ गौतम को सम्बोधि प्राप्त हुई । सर्वज्ञता प्राप्त हुई। प्रकृति के रहस्यों को जान लिया। <br><br>
      सर्वज्ञता का साक्षात्कार पाने पर भगवान बुद्ध ने प्रकृति की वास्तवता का परीक्षण किया और उन्हें स्पष्ट दीखने लगा कि, उनका यह ठोस प्रतीत होनेवाला शरीर वस्तुत: असंख्य -असंख्य परमाणुओं का, कलापों का पुंज मात्र हैं । ये कलाप परमाणुओं से भी नन्हे हैं और इनके आगे टुकडे नहीं हो सकते ।
      <br><br>
      सारनाथ में भगवान बुद्ध ने  पांच परिव्राजक को ( कौण्डिन्य, वप्प, भद्दिय, महानाम और अश्वजित ) अनुभव कराया कि सारा मानव शरीर कलापों से बना हुआ हैं और प्रत्येक कलाप उत्पन्न होकर नष्ट हो जाता हैं- उप्पजित्वा-निरूझन्ति ।
      <br><br>
      यह कलाप भी इकाई न होकर एक समूह हैं, जो निम्न भौतिक तत्वओं से बना हैं :
      <br>
      1) पृथ्वी धातु  ( धातु याने स्वभाव ) और उसके गुणधर्म - जैसे - हल्का,  भारी - प्रसारण शक्ति ।
      <br>
      2) अग्नि धातु और उसके गुणधर्म - जैसे - ठंडा, गरम -संतापन शक्ति ।
      <br>
      3) वायुधातु  और उसके गुणधर्म - जैसे - हलन चलन - संचालन शक्ति ।
      <br>
      4) आप धातु और उसके गुणधर्म - जैसे - बांधना - संयोजन शक्ति ।
      <br><br>
      इस तरह,  ये चार धातु और उनके चार गुणधर्म मिलाकर आठ कलापों के समूह को अष्टकलाप का नाम बुद्ध ने दिया ।
      भौतिक जगत का नन्हे से नन्हा कण कलाप हैं । एक कलाप तब बनता हैं, जबकी उपरोक्त आठों तत्व, जो कि वस्तुतः गुणधर्म स्वभाव हैं, एक साथ एकत्रित होते हैं ।
      यह अष्टकलाप पुंज अविरत गति से बिना रुके गतिमान रहते हैं। उदय और व्यय की इस प्रक्रिया के कारण संवेदना अनुभव होती है। ठोस लगता हुआ प्रत्येक पदार्थ भी तरंग मात्र है।
      इस सत्य अनुभव को तथागत ने वर्णित किया-
      <br><br>
      " सब्बो पज्जलितो लोको,
         सब्बो लोको पकम्पितो ।"
      <br><br>
      भगवान बुद्ध ने साक्षात्कार किया कि ये कलापों का प्रतिक्षण अगणित बार परिवर्तन हो रहा हैं, संगठन -विघटन हो रहा हैं, और यह क्रम निरंतर निर्बाध चल रहा है। ये कलाप शक्ति के स्त्रोत प्रवाह हैं ।
      <br><br>
      नमो बुद्धाय🙏🏻🙏🏻🙏🏻
    </div>

    <div id="msg9" style="display: none;">
      धम्म (शुद्ध धर्म) के दो प्रमुख पक्ष हैं- पहला सैद्धांतिक पक्ष यानी मूल पाठ जिसे परियत्ति कहते हैं और दूसरा व्यावहारिक यानी प्रायोगिक पक्ष जिसे पटिपत्ति कहते हैं।
      <br>
      बुद्ध-वचनों का दैनिक जीवन में अभ्यास ही पटिपत्ति है। यही धर्म का वास्तविक प्रचार वाहन है। धम्म की वास्तविक लोकप्रियता राजकीय संरक्षण या लोगों द्वारा सैद्धांतिक पक्ष की स्वीकृति मात्र से नहीं थी, बल्कि इसलिए थी कि भगवान बुद्ध ने मन को शुद्ध करने की विद्या- विपस्सना साधना के अभ्यास की विधा स्पष्ट रूप से सिखायी।
      <br><br>
      उन्होंने हमारे दु:ख का कारण बताया तथा कारण को मिटा कर वास्तविक शांति की अनुभूति करने का मार्ग दिखाया। धम्म के सुस्पष्ट, सुनिश्चित, हितकारी, सहज ज्ञात होने वाले, यहीं और अभी फल देने वाले, क्रमश: मुक्ति के लक्ष्य की ओर ले जाने वाले पहलू ने विभिन्न वर्ग के लोगों को अपनी ओर आकर्षित किया, जिसके फलस्वरूप धम्म विश्वव्यापी हुआ।
      <br><br>
      इस मुक्ति के मार्ग में परियत्ति और पटिपत्ति दोनों का अपना महत्त्व है। दोनों एक साथ चलें तो प्रगति ज्यादा से ज्यादा होती चली जाती है।
      <br><br>
      🦌 एक हिरन का दृष्टांत 🦌
      <br><br>
      एक हिरन था। जिसकी एक ही आंख थी। उसी से ही वह इस दुनिया को देख पाता था । कहीं कुछ खाने-पीने का प्रसंग आता तो अनेक बार वहां मुँह मारता जिधर वह देख नहीं पाता था। इसलिए वह सदैव बड़ा सजग रहता था।
      <br><br>
      एक दिन वह समुद्र के किनारे चहल-कदमी कर रहा था और उसे समुद्र के परली तरफ जिधर उसकी आंख थी एक बड़ा सुंदर पदार्थ दिखायी दिया। वह टस-से-मस हुए बिना उसे देखे जा रहा था। तभी एक समुद्री जहाज तट के करीब आ रहा था। उस जहाज के यात्रीगण उस समुद्र तट को देखकर बहुत खुश हो रहे थे उनमें से कई का ध्यान उस हिरन की तरफ आकृष्ट हुआ। जो दूरबीन से देखने पर बड़ा सुंदर प्रतीत होता था।
      <br><br>
      वैसे तो हिरन इधर-उधर भागते रहते हैं परंतु यह एक टक होकर किसी चीज को देखते जा रहा था। ऐसे सुंदर हिरन को पाने की दृष्टि से एक यात्री ने अपने सामान में से बंदूक निकाली और हिरन पर दाग दी। हिरन वहीं पर धराशायी हो गया। एक हिरन अपनी दूसरी आँख से देखे जाने वाले दृश्यों से निश्चिंत हो गया था। इसे यह आभास हो रहा था कि उसे समुद्र की तरफ की दिशा से कोई खतरा नहीं है। अपनी इस भूल के कारण उसे अपने प्राणों से हाथ धोना पड़ा।
      <br><br>
      यह उदाहरण इसलिए दिया गया है परियत्ति, पटिपत्ति और पटिवेधन- इन तीनों का समागम होता है। परियत्ति से अभिप्राय- बुद्धवाणी से है और पटिपत्ति का अभिप्राय उसके अनुसार ध्यान करने से है। पटिवेधन से अभिप्राय- साधना की गहराई में प्रवेश करने से लिया जाता है जिससे कि साधना का अंतिम लक्ष्य प्राप्त हो सके।
      <br><br>
      भगवान बुद्ध के समय में उनकी वाणी को लोग अपने आचरण में उतारते और ध्यान में पुष्ट होकर अंतिम अवस्था भी प्राप्त कर लेते थे। भगवान साधकों की शंकाओं का उन्मूलन करते। बुद्धवाणी साधकों के लिए मार्गदर्शक है। परियत्ति का पर्याप्त मात्रा में ज्ञान आवश्यक है जिससे कि समझ में आ सके कि पटिपत्ति किस तरह से करनी है।
      <br><br>
      बहुत बार ऐसा देखा गया है कि साधना (पटिपत्ति) भगवान की वाणी के सर्वथा अनुरूप नहीं होती जिससे कि साधना सफल नहीं हो पाती। यह प्रसंग ऐसे ही दिखता है जैसे ऊपर बताये गये हिरन का है जो केवल एक ही दिशा में समुद्र के परले की ओर अपना सारा समय बिताना चाहता था। उसके कभी ध्यान में भी नहीं आया कि समुद्र की दिशा की तरफ से ऐसी चीज हो सकती है जो उसके लिए हानिकारक सिद्ध हो।
      <br><br>
      इसलिए पटिपत्ति पर आरूढ़ साधक के लिए परियत्ति का ज्ञान भी साधना-मार्ग में सही दिशा एवं प्रगति के लिए आवश्यक है।- सत्यनारायण गोयनका
      <br><br>
      नमो बुद्धाय🙏🙏🙏
    </div>

    <!-- Start Bootstrap Popup model -->
    <div class="modal fade" id="model" tabindex="-1">
      <div class="modal-dialog modal-dialog-centered ">
        <div class="modal-content">
          <div class="modal-header">
            <!-- <h1 class="modal-title fs-5" id="modeltitle">
              <p> "ये च बुद्धा अतीता च ये च बुद्धा अनागता। </p>
              <p> पच्चुपन्ना च ये बुद्धा अहं वन्दामि सब्बदा।। "</p>
            </h1> -->
            <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
          </div>
          <div class="modal-body text-black lh-lg " id="modelbody">

          </div>
          <div class="modal-footer">
            <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">Close</button>
          </div>
        </div>
      </div>
    </div>
    <!-- End Bootstrap Popup model -->

    <!-- #content -->
    <?php require("common/footer.php"); ?>
  </div>
  <!-- #page -->

  <?php require("common/foot.php"); ?>

  <script>
    let icon = document.getElementsByClassName("icon")
    for (let i = 0; i < icon.length; i++) {
      icon[i].innerHTML = ` <a href="#" class="btn">
                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640" style="width: 30px;">
                      <path d="M144 224C161.7 224 176 238.3 176 256L176 512C176 529.7 161.7 544 144 544L96 544C78.3 544 64 529.7 64 512L64 256C64 238.3 78.3 224 96 224L144 224zM334.6 80C361.9 80 384 102.1 384 129.4L384 133.6C384 140.4 382.7 147.2 380.2 153.5L352 224L512 224C538.5 224 560 245.5 560 272C560 291.7 548.1 308.6 531.1 316C548.1 323.4 560 340.3 560 360C560 383.4 543.2 402.9 521 407.1C525.4 414.4 528 422.9 528 432C528 454.2 513 472.8 492.6 478.3C494.8 483.8 496 489.8 496 496C496 522.5 474.5 544 448 544L360.1 544C323.8 544 288.5 531.6 260.2 508.9L248 499.2C232.8 487.1 224 468.7 224 449.2L224 262.6C224 247.7 227.5 233 234.1 219.7L290.3 107.3C298.7 90.6 315.8 80 334.6 80z" />
                    </svg>
                    <b>Like</b>
                  </a>
                  <a href="#" class="btn">
                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640" style="width: 30px;">
                      <path d="M448 256C501 256 544 213 544 160C544 107 501 64 448 64C395 64 352 107 352 160C352 165.4 352.5 170.8 353.3 176L223.6 248.1C206.7 233.1 184.4 224 160 224C107 224 64 267 64 320C64 373 107 416 160 416C184.4 416 206.6 406.9 223.6 391.9L353.3 464C352.4 469.2 352 474.5 352 480C352 533 395 576 448 576C501 576 544 533 544 480C544 427 501 384 448 384C423.6 384 401.4 393.1 384.4 408.1L254.7 336C255.6 330.8 256 325.5 256 320C256 314.5 255.5 309.2 254.7 304L384.4 231.9C401.3 246.9 423.6 256 448 256z" />
                    </svg>
                    <b>Share</b>
                  </a>`
    }

    let modelbody = document.getElementById("modelbody");

    function showmsg(num) {
      let btn = document.getElementById(`btn${num}`);
      let msg = document.getElementById(`msg${num}`);
      modelbody.innerHTML = msg.innerHTML;
    }
  </script>

</body>

</html>